jonastbrg/FlipperAgent/flipperzero-mcp/firmware/tcp_uart_bridge/sdkconfig.defaults
# TCP-UART Bridge SDK Configuration Defaults

# Target ESP32-S2 (Flipper WiFi Dev Board)
CONFIG_IDF_TARGET="esp32s2"

# Bridge settings
CONFIG_BRIDGE_TCP_PORT=8080
CONFIG_BRIDGE_UART_BAUD_RATE=115200
CONFIG_BRIDGE_UART_TX_PIN=43
CONFIG_BRIDGE_UART_RX_PIN=44
CONFIG_BRIDGE_AP_SSID="FlipperBridge"
CONFIG_BRIDGE_AP_PASSWORD="flipper123"
CONFIG_BRIDGE_MAX_CLIENTS=1

# WiFi settings
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""

# Increase task stack sizes for networking
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072

# Enable mDNS for easy discovery
CONFIG_MDNS_STRICT_MODE=n

# NVS for storing WiFi credentials
CONFIG_NVS_ENCRYPTION=n

# HTTP Server settings
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
